In [1]:
pip install cryptography --upgrade

Requirement already satisfied: cryptography in c:\users\felip\anaconda3\lib\site-packages (44.0.1)
Requirement already satisfied: cffi>=1.12 in c:\users\felip\anaconda3\lib\site-packages (from cryptography) (1.17.1)
Requirement already satisfied: pycparser in c:\users\felip\anaconda3\lib\site-packages (from cffi>=1.12->cryptography) (2.21)
Note: you may need to restart the kernel to use updated packages.

In [4]:
pip install xlrd

Requirement already satisfied: xlrd in c:\users\felip\anaconda3\lib\site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [5]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\felip\anaconda3\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\felip\anaconda3\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
pip install msoffcrypto-tool

Requirement already satisfied: msoffcrypto-tool in c:\users\felip\anaconda3\lib\site-packages (5.4.2)
Requirement already satisfied: cryptography>=39.0 in c:\users\felip\anaconda3\lib\site-packages (from msoffcrypto-tool) (44.0.1)
Requirement already satisfied: olefile>=0.46 in c:\users\felip\anaconda3\lib\site-packages (from msoffcrypto-tool) (0.47)
Requirement already satisfied: cffi>=1.12 in c:\users\felip\anaconda3\lib\site-packages (from cryptography>=39.0->msoffcrypto-tool) (1.17.1)
Requirement already satisfied: pycparser in c:\users\felip\anaconda3\lib\site-packages (from cffi>=1.12->cryptography>=39.0->msoffcrypto-tool) (2.21)
Note: you may need to restart the kernel to use updated packages.

In [9]:
pip install pandas

Collecting pandas
  Using cached pandas-2.2.3-cp312-cp312-win_amd64.whl.metadata (19 kB)
Collecting numpy>=1.26.0 (from pandas)
  Downloading numpy-2.2.3-cp312-cp312-win_amd64.whl.metadata (60 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\felip\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\felip\anaconda3\lib\site-packages (from pandas) (2024.1)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\felip\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Using cached pandas-2.2.3-cp312-cp312-win_amd64.whl (11.5 MB)
Downloading numpy-2.2.3-cp312-cp312-win_amd64.whl (12.6 MB)
   ---------------------------------------- 0.0/12.6 MB ? eta -:--:--
   ------------- -------------------------- 4.2/12.6 MB 22.9 MB/s eta 0:00:01
   ---------------------------------------  12.6/12.6 MB 34.3 MB/s eta 0:00:01
   ---------------------------------------- 12.6/12.6 MB 31.6 MB/s eta 0:00:00
Downloading tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: tzdata, numpy, pandas
Successfully installed numpy-2.2.3 pandas-2.2.3 tzdata-2025.1
Note: you may need to restart the kernel to use updated packages.

In [10]:
import pandas as pd

### Creating a Pandas Data Frame

In [11]:
data = [['John', 31], ['Hugo', 23], ['Laura', 19]]
columns = ['name', 'age']

In [12]:
df = pd.DataFrame(data=data, columns=columns)
df

    name  age
0   John   31
1   Hugo   23
2  Laura   19

In [13]:
df.age

0    31
1    23
2    19
Name: age, dtype: int64

In [14]:
df['age']

0    31
1    23
2    19
Name: age, dtype: int64

In [15]:
df.dtypes

name    object
age      int64
dtype: object

In [16]:
df.age + df.age

0    62
1    46
2    38
Name: age, dtype: int64

In [17]:
df.age + df.age * 3

0    124
1     92
2     76
Name: age, dtype: int64

In [18]:
df.age[0]

np.int64(31)

In [19]:
df[['name', 'age']]

    name  age
0   John   31
1   Hugo   23
2  Laura   19

### Reading XLSX Files

In [21]:
df_xlsx = pd.read_excel('clientes.xlsx')
df_xlsx

,id_cliente,id_regiao,primeiroNome,NomeMeio,UltimoNome,data_nascimento,Sexo,Email
0,11000,26,Jon,V,Yang,1971-10-06,M,jon24@adventure-works.com
1,11001,37,Eugene,L,Huang,1976-05-10,M,eugene10@adventure-works.com
2,11002,31,Ruben,NaN,Torres,1971-02-09,M,ruben35@adventure-works.com
3,11003,11,Christy,NaN,Zhu,1973-08-14,F,christy12@adventure-works.com
4,11004,19,Elizabeth,NaN,Johnson,1979-08-05,F,elizabeth5@adventure-works.com
...,...,...,...,...,...,...,...,...
995,11995,39,Kelvin,A,Carson,1965-12-12,M,kelvin11@adventure-works.com
996,11996,21,Veronica,NaN,Srini,1966-01-30,F,veronica9@adventure-works.com
997,11997,2,Kristina,NaN,Kapoor,1971-04-04,F,kristina1@adventure-works.com
998,11998,24,Donna,NaN,Sharma,1966-02-07,F,donna9@adventure-works.com
999,11999,10,Johnny,NaN,Shan,1965-12-03,M,johnny11@adventure-works.com

### Reading XLS Files

In [22]:
df_xls = pd.read_excel('fornecedores.xls')
df_xls

   IDFORNECEDOR        NOME
0             1    MOTOROLA
1             2  NOKIA PLUS
2             3     SAMSUNG
3             4          LG
4             5      DREAMC
5             6      GFORCE
6             7       APPLE
7             8        SONY
8             9     WALLITA
9            10        ARNO

### Reading CSV Files

In [23]:
df_csv = pd.read_csv('alunos.csv', sep=';')
df_csv

          id  genero                     nome
0          1  male    Martins
1          2  male    Carvalho
2          3  female  Rocha
3          4  male    Cunha
4          5  female  Costa
...      ...     ...                      ...
29995  29996  female  Dias
29996  29997  male    Gomes
29997  29998  female  Almeida
29998  29999  male    Cavalcanti
29999  30000  male    Alves

[30000 rows x 3 columns]

### Reading TXT Files

In [25]:
df_txt = pd.read_csv('regioes.txt', encoding='latin1', sep=';')
df_txt

,id_regiao,cidade,estado,país
0,1,Alexandria,New South Wales ...,Australia ...
1,2,Coffs Harbour,New South Wales ...,Australia ...
2,3,Darlinghurst,New South Wales ...,Australia ...
3,4,Goulburn,New South Wales ...,Australia ...
4,5,Lane Cove,New South Wales ...,Australia ...
...,...,...,...,...
650,651,Mosinee,Wisconsin ...,United States ...
651,652,Racine,Wisconsin ...,United States ...
652,653,Casper,Wyoming ...,United States ...
653,654,Cheyenne,Wyoming ...,United States ...
654,655,Rock Springs,Wyoming ...,United States ...

### Reading JSON Files

In [26]:
df_json = pd.read_json('moedas.json', orient='index')
df_json

,0,1,2,3,4,5,6,7,8,9,...,95,96,97,98,99,100,101,102,103,104
data,"{'CurrencyAlternateKey': 'AFA', 'CurrencyKey':...","{'CurrencyAlternateKey': 'DZD', 'CurrencyKey':...","{'CurrencyAlternateKey': 'ARS', 'CurrencyKey':...","{'CurrencyAlternateKey': 'AMD', 'CurrencyKey':...","{'CurrencyAlternateKey': 'AWG', 'CurrencyKey':...","{'CurrencyAlternateKey': 'AUD', 'CurrencyKey':...","{'CurrencyAlternateKey': 'AZM', 'CurrencyKey':...","{'CurrencyAlternateKey': 'BSD', 'CurrencyKey':...","{'CurrencyAlternateKey': 'BHD', 'CurrencyKey':...","{'CurrencyAlternateKey': 'THB', 'CurrencyKey':...",...,"{'CurrencyAlternateKey': 'TND', 'CurrencyKey':...","{'CurrencyAlternateKey': 'TRL', 'CurrencyKey':...","{'CurrencyAlternateKey': 'GBP', 'CurrencyKey':...","{'CurrencyAlternateKey': 'UYU', 'CurrencyKey':...","{'CurrencyAlternateKey': 'USD', 'CurrencyKey':...","{'CurrencyAlternateKey': 'KRW', 'CurrencyKey':...","{'CurrencyAlternateKey': 'JPY', 'CurrencyKey':...","{'CurrencyAlternateKey': 'CNY', 'CurrencyKey':...","{'CurrencyAlternateKey': 'ZWD', 'CurrencyKey':...","{'CurrencyAlternateKey': 'PLN', 'CurrencyKey':..."

In [27]:
df_csv.head(3)

   id  genero                     nome
0   1  male    Martins
1   2  male    Carvalho
2   3  female  Rocha

### Renaming Columns

In [28]:
df_csv = df_csv.rename(columns={'genero':'genre', 'nome':'name'})
df_csv

          id   genre                     name
0          1  male    Martins
1          2  male    Carvalho
2          3  female  Rocha
3          4  male    Cunha
4          5  female  Costa
...      ...     ...                      ...
29995  29996  female  Dias
29996  29997  male    Gomes
29997  29998  female  Almeida
29998  29999  male    Cavalcanti
29999  30000  male    Alves

[30000 rows x 3 columns]

### Filtering Data

In [29]:
df_filter = df_csv[df_csv.genre == 'female']
df_filter

          id   genre                     name
2          3  female  Rocha
4          5  female  Costa
7          8  female  Oliveira
10        11  female  Melo
11        12  female  Martins
...      ...     ...                      ...
29990  29991  female  Ribeiro
29991  29992  female  Lima
29992  29993  female  Ferreira
29995  29996  female  Dias
29997  29998  female  Almeida

[14812 rows x 3 columns]

In [31]:
df_filter = df_csv[df_csv.genre != 'female']
df_filter

          id   genre                     name
0          1  male    Martins
1          2  male    Carvalho
3          4  male    Cunha
5          6  male    Cardoso
6          7  male    Almeida
...      ...     ...                      ...
29993  29994  male    Oliveira
29994  29995  male    Rodrigues
29996  29997  male    Gomes
29998  29999  male    Cavalcanti
29999  30000  male    Alves

[15188 rows x 3 columns]

### Pandas Boolean Operators
##### and -> &
##### or  -> |
##### not -> -

In [32]:
df_filter = df_csv[(df_csv['genre'] == 'female') & (df_csv['id'] > 10000)]
df_filter

          id   genre                     name
10000  10001  female  Dias
10001  10002  female  Dias
10003  10004  female  Barros
10004  10005  female  Almeida
10005  10006  female  Goncalves
...      ...     ...                      ...
29990  29991  female  Ribeiro
29991  29992  female  Lima
29992  29993  female  Ferreira
29995  29996  female  Dias
29997  29998  female  Almeida

[9816 rows x 3 columns]

### Aggregate Functions

In [36]:
print(df_csv['id'].mean())
print(df_csv['id'].min())
print(df_csv['id'].max())

15000.5
1
30000

In [37]:
df_csv['id'].describe()
# df_csv['numerical_colum1', 'numerical_column2', ...].describe()

count    30000.000000
mean     15000.500000
std       8660.398374
min          1.000000
25%       7500.750000
50%      15000.500000
75%      22500.250000
max      30000.000000
Name: id, dtype: float64

In [40]:
df_csv.groupby(['genre']).min().head(10)[['id']]

        id
genre
female   3
male     1

In [41]:
df_group = df_csv.groupby(['genre']) [['id']].mean().head(10)
df_group

                  id
genre
female  14952.987240
male    15046.836516

### Reset Index

In [42]:
df_group.columns

Index(['id'], dtype='object')

In [43]:
df_reset = df_group.reset_index()
df_reset

    genre            id
0  female  14952.987240
1  male    15046.836516

### Sorting

In [44]:
df_csv.sort_values(['id']).head(10)

   id   genre                     name
0   1  male    Martins
1   2  male    Carvalho
2   3  female  Rocha
3   4  male    Cunha
4   5  female  Costa
5   6  male    Cardoso
6   7  male    Almeida
7   8  female  Oliveira
8   9  male    Castro
9  10  male    Fernandes

In [45]:
df_csv['id'].sort_values()

0            1
1            2
2            3
3            4
4            5
         ...
29995    29996
29996    29997
29997    29998
29998    29999
29999    30000
Name: id, Length: 30000, dtype: int64

In [46]:
df_csv['id'].sort_values(ascending=False)

29999    30000
29998    29999
29997    29998
29996    29997
29995    29996
         ...
4            5
3            4
2            3
1            2
0            1
Name: id, Length: 30000, dtype: int64

In [47]:
df_csv.isna().sum()

id       0
genre    0
name     0
dtype: int64

### Dropping NaN

In [48]:
df_csv.dropna()

          id   genre                     name
0          1  male    Martins
1          2  male    Carvalho
2          3  female  Rocha
3          4  male    Cunha
4          5  female  Costa
...      ...     ...                      ...
29995  29996  female  Dias
29996  29997  male    Gomes
29997  29998  female  Almeida
29998  29999  male    Cavalcanti
29999  30000  male    Alves

[30000 rows x 3 columns]

### Impute Column

In [50]:
df_csv.fillna('genre')

          id   genre                     name
0          1  male    Martins
1          2  male    Carvalho
2          3  female  Rocha
3          4  male    Cunha
4          5  female  Costa
...      ...     ...                      ...
29995  29996  female  Dias
29996  29997  male    Gomes
29997  29998  female  Almeida
29998  29999  male    Cavalcanti
29999  30000  male    Alves

[30000 rows x 3 columns]

In [54]:
df_csv.fillna({'id': 0, 'genre': 'unknown'}, inplace=False)

          id   genre                     name
0          1  male    Martins
1          2  male    Carvalho
2          3  female  Rocha
3          4  male    Cunha
4          5  female  Costa
...      ...     ...                      ...
29995  29996  female  Dias
29996  29997  male    Gomes
29997  29998  female  Almeida
29998  29999  male    Cavalcanti
29999  30000  male    Alves

[30000 rows x 3 columns]

### Write to CSV (Databricks Data Platform)

In [0]:
write_path = '/YourDir/FileName.csv'
dbutils.fs.rm(write_path) #remove file if exists
#df_csv.to_csv(write_path.replace('dbfs:', '/dbfs'), index=False)
df_csv.to_csv(write_path, index=False)